#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      + data             = (sensitive value)
      + data_json        = (sensitive value)
      + id               = (known after apply)
      + lease_duration   = (known after apply)
      + lease_id         = (known after apply)
      + lease_renewable  = (known after apply)
      + lease_start_time = (known after apply)
      + path             = "secret/suitable/terraform/stackdriver/slack-token"
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        display_name = "production"
        enabled      = true
        id           = "projects/terra-datarepo-production/notificationChannels/464975950067283356"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/terra-datarepo-production/notificationChannels/464975950067283356"
        project      = "terra-datarepo-production"
        type         = "slack"
        user_labels  = {}
    }

  # module.datarepo-app.google_project_iam_member.api_sa_role[0] will be created
  + resource "google_project_iam_member" "api_sa_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:datarepo-jade-api@terra-datarepo-production.iam.gserviceaccount.com"
      + project = "terra-datarepo-production"
      + role    = "roles/bigquery.admin"
    }

  # module.datarepo-app.google_project_iam_member.test_runner_sa_role[0] will be created
  + resource "google_project_iam_member" "test_runner_sa_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "terra-datarepo-production"
      + role    = "roles/container.admin"
    }

  # module.datarepo-app.google_project_iam_member.test_runner_sa_role[1] will be created
  + resource "google_project_iam_member" "test_runner_sa_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "terra-datarepo-production"
      + role    = "roles/logging.viewer"
    }

  # module.datarepo-app.google_project_iam_member.test_runner_sa_role[2] will be created
  + resource "google_project_iam_member" "test_runner_sa_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "terra-datarepo-production"
      + role    = "roles/monitoring.viewer"
    }

  # module.datarepo-app.google_project_iam_member.test_runner_sa_role[3] will be created
  + resource "google_project_iam_member" "test_runner_sa_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "terra-datarepo-production"
      + role    = "roles/secretmanager.admin"
    }

  # module.datarepo-app.google_service_account.datarepo_test_runner_sa[0] will be created
  + resource "google_service_account" "datarepo_test_runner_sa" {
      + account_id   = "datarepo-jade-test-runner"
      + display_name = "datarepo-jade-test-runner"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "terra-datarepo-production"
      + unique_id    = (known after apply)
    }

  # module.datarepo-app.google_service_account_key.test_runner_sa_key[0] will be created
  + resource "google_service_account_key" "test_runner_sa_key" {
      + id                      = (known after apply)
      + key_algorithm           = "KEY_ALG_RSA_2048"
      + name                    = (known after apply)
      + pgp_key                 = (known after apply)
      + private_key             = (sensitive value)
      + private_key_encrypted   = (known after apply)
      + private_key_fingerprint = (known after apply)
      + private_key_type        = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key              = (known after apply)
      + public_key_type         = "TYPE_X509_PEM_FILE"
      + service_account_id      = (known after apply)
      + valid_after             = (known after apply)
      + valid_before            = (known after apply)
    }

  # module.datarepo-app.vault_generic_secret.test_runner_sa_key[0] will be created
  + resource "vault_generic_secret" "test_runner_sa_key" {
      + data         = (sensitive value)
      + data_json    = (sensitive value)
      + disable_read = false
      + id           = (known after apply)
      + path         = "secret/dsde/datarepo/production/test-runner-sa"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-data[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-data" {
        etag    = "BwWxkW4Ouhs="
        id      = "terra-datarepo-production/roles/bigquery.dataOwner"
      ~ members = [
          + "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.dataOwner"
    }

  # module.datarepo-monitoring.module.audit-log-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
        etag    = "BwWxkW4Ouhs="
        id      = "terra-datarepo-production/roles/logging.configWriter"
      ~ members = [
          + "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/logging.configWriter"
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.bigquery-admin[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-admin" {
        etag    = "BwWxkW4Ouhs="
        id      = "terra-datarepo-production/roles/bigquery.admin"
      ~ members = [
          - "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.admin"
    }

  # module.datarepo-monitoring.module.performance-log-sinks.google_project_iam_binding.pubsub-publisher-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "pubsub-publisher-permisson" {
        etag    = "BwWxkW4Ouhs="
        id      = "terra-datarepo-production/roles/pubsub.publisher"
      ~ members = [
          - "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/pubsub.publisher"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-admin[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-admin" {
        etag    = "BwWxkW4Ouhs="
        id      = "terra-datarepo-production/roles/bigquery.admin"
      ~ members = [
          - "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.admin"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-data[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-data" {
        etag    = "BwWxkW4Ouhs="
        id      = "terra-datarepo-production/roles/bigquery.dataOwner"
      ~ members = [
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/bigquery.dataOwner"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.bigquery-log-writer-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "bigquery-log-writer-permisson" {
        etag    = "BwWxkW4Ouhs="
        id      = "terra-datarepo-production/roles/logging.configWriter"
      ~ members = [
          - "serviceAccount:p545052482238-398799@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/logging.configWriter"
    }

  # module.datarepo-monitoring.module.user-activity-sinks.google_project_iam_binding.pubsub-publisher-permisson[0] will be updated in-place
  ~ resource "google_project_iam_binding" "pubsub-publisher-permisson" {
        etag    = "BwWxkW4Ouhs="
        id      = "terra-datarepo-production/roles/pubsub.publisher"
      ~ members = [
          - "serviceAccount:p545052482238-240204@gcp-sa-logging.iam.gserviceaccount.com",
          + "serviceAccount:p545052482238-436049@gcp-sa-logging.iam.gserviceaccount.com",
        ]
        project = "terra-datarepo-production"
        role    = "roles/pubsub.publisher"
    }

Plan: 8 to add, 9 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `environments/production`*
